bouffalolab/bl_iot_sdk-components/platform/soc/bl702/bl702_ethernet/Src/eth_bd.c
        if ((++thiz->rxIndexCPU) > thiz->rxBuffLimit) {
            /* wrap back */
            thiz->rxIndexCPU = thiz->txBuffLimit + 1;
            bd->C_S_L = (EMAC_BD_FIELD_MSK(RX_IRQ) | EMAC_BD_FIELD_MSK(RX_E) | (ETH_MAX_BUFFER_SIZE << 16) | EMAC_BD_FIELD_MSK(RX_WR));
        } else {
            bd->C_S_L = (EMAC_BD_FIELD_MSK(RX_IRQ) | EMAC_BD_FIELD_MSK(RX_E) | (ETH_MAX_BUFFER_SIZE << 16));
        }
#endif
    }
    printf("h addr %p\r\n", h);
    return h;
}

static unsigned int rx_counter;
static inline err_t bl702ethernetif_input(struct netif *netif)
{
    err_t err = ERR_OK;
    struct pbuf *p;
    EMAC_BD_Desc_Type *bd;

    /* move received packet into a new pbuf */
    do {

        bd = &thiz->bd[thiz->rxIndexCPU];
        if(bd->C_S_L & EMAC_BD_FIELD_MSK(RX_E)) {

            printf("low level input idx %d, empty\r\n", thiz->rxIndexCPU);

            if (thiz->rxIndexCPU == thiz->rxBuffLimit) {
                thiz->rxIndexCPU = thiz->txBuffLimit + 1;
                bd->C_S_L = (EMAC_BD_FIELD_MSK(RX_IRQ) | EMAC_BD_FIELD_MSK(RX_E) | (ETH_MAX_BUFFER_SIZE << 16) | EMAC_BD_FIELD_MSK(RX_WR));
            } else {
                bd->C_S_L = (EMAC_BD_FIELD_MSK(RX_IRQ) | EMAC_BD_FIELD_MSK(RX_E) | (ETH_MAX_BUFFER_SIZE << 16));
                thiz->rxIndexCPU ++;
            }
            continue;
        }

        printf("low level input idx %d\r\n", thiz->rxIndexCPU);
        p = low_level_input(netif);

        rx_counter++;
        /* no packet could be read, silently ignore this */
        if (p == NULL) return ERR_MEM;

        /* entry point to the LwIP stack */
        err = netif->input(p, netif);

        if (err != ERR_OK)
        {
            printf("ethernetif_input: IP input error\n");
            pbuf_free(p);
        }
    } while (emac_bd_get_cur_rx_buffer_active() != thiz->rxIndexCPU);

    return err;
}

/* recv a pkt */
void EMAC_RX_Done_Callback(void)
{
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    
    if (NULL == DequeueTaskHandle) {
        return;
    }

    xTaskNotifyFromISR(DequeueTaskHandle, 0x02, eSetBits, &xHigherPriorityTaskWoken);
    portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
}

void EMAC_RX_Error_Callback(int index)
{
    if (thiz->bd[index].C_S_L & EMAC_BD_FIELD_MSK(RX_OR)) {
        printf("EMAC RX OR Error @ %d\r\n", index);
    }

    if (thiz->bd[index].C_S_L & EMAC_BD_FIELD_MSK(RX_RE)) {
        printf("EMAC RX_RE Error @ %d\r\n", index);
    }

    if (thiz->bd[index].C_S_L & EMAC_BD_FIELD_MSK(RX_DN)) {
        printf("EMAC RX_DN Error @ %d\r\n", index);
    }

    if (thiz->bd[index].C_S_L & EMAC_BD_FIELD_MSK(RX_TL)) {
        printf("EMAC RX_TL Error @ %d\r\n", index);
    }

    if (thiz->bd[index].C_S_L & EMAC_BD_FIELD_MSK(RX_CRC)) {
        printf("EMAC RX_CRC Error @ %d\r\n", index);
    }

    if (thiz->bd[index].C_S_L & EMAC_BD_FIELD_MSK(RX_LC)) {
        printf("EMAC RX_LC Error @ %d\r\n", index);
    }

    if (index == thiz->rxBuffLimit) {
        thiz->bd[index].C_S_L = (EMAC_BD_FIELD_MSK(RX_IRQ) | EMAC_BD_FIELD_MSK(RX_E) | (ETH_MAX_BUFFER_SIZE << 16) | EMAC_BD_FIELD_MSK(RX_WR));
    } else {
        thiz->bd[index].C_S_L = (EMAC_BD_FIELD_MSK(RX_IRQ) | EMAC_BD_FIELD_MSK(RX_E) | (ETH_MAX_BUFFER_SIZE << 16));
    }
}

void EMAC_RX_Busy_Callback(void)
{
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    
    if (NULL == DequeueTaskHandle) {
        return;
    }

    xTaskNotifyFromISR(DequeueTaskHandle, 0x02, eSetBits, &xHigherPriorityTaskWoken);
    portYIELD_FROM_ISR(xHigherPriorityTaskWoken);

    printf("RX busy %u @ %d\r\n", rx_counter, emac_bd_get_cur_rx_buffer_active());
}

void emac_irq_process(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(EMAC_BASE,EMAC_INT_MASK);

    if (SET == emac_getintstatus(EMAC_INT_TX_DONE) && !BL_IS_REG_BIT_SET(tmpVal,EMAC_TXB_M)) {
        //printf("EMAC_INT_TX_DONE\r\n");
        EMAC_TX_Done_Callback();
        emac_clrintstatus(EMAC_INT_TX_DONE);
    }

    if (SET == emac_getintstatus(EMAC_INT_TX_ERROR) && !BL_IS_REG_BIT_SET(tmpVal,EMAC_TXE_M)) {
        //printf("EMAC_INT_TX_ERROR\r\n");
        EMAC_TX_Error_Callback(thiz->txIndexCPU);
        emac_clrintstatus(EMAC_INT_TX_ERROR);
    }

    if (SET == emac_getintstatus(EMAC_INT_RX_DONE) && !BL_IS_REG_BIT_SET(tmpVal,EMAC_RXB_M)) {
        //printf("EMAC_INT_RX_DONE\r\n");
        EMAC_RX_Done_Callback();
        emac_clrintstatus(EMAC_INT_RX_DONE);
    }

    if (SET == emac_getintstatus(EMAC_INT_RX_ERROR) && !BL_IS_REG_BIT_SET(tmpVal,EMAC_RXE_M)) {
        //printf("EMAC_INT_RX_ERROR\r\n");
        EMAC_RX_Error_Callback(thiz->rxIndexCPU);
        emac_clrintstatus(EMAC_INT_RX_ERROR);
    }

    if (SET == emac_getintstatus(EMAC_INT_RX_BUSY) && !BL_IS_REG_BIT_SET(tmpVal,EMAC_BUSY_M)) {
        //printf("EMAC_INT_RX_BUSY\r\n");
        EMAC_RX_Busy_Callback();
        emac_clrintstatus(EMAC_INT_RX_BUSY);
    }

    if (SET == emac_getintstatus(EMAC_INT_TX_CTRL) && !BL_IS_REG_BIT_SET(tmpVal,EMAC_TXC_M)) {
        //printf("EMAC_INT_TX_CTRL\r\n");
        emac_clrintstatus(EMAC_INT_TX_CTRL);
    }

    if (SET == emac_getintstatus(EMAC_INT_RX_CTRL) && !BL_IS_REG_BIT_SET(tmpVal,EMAC_RXC_M)) {
        //printf("EMAC_INT_RX_CTRL\r\n");
        emac_clrintstatus(EMAC_INT_RX_CTRL);
    }
}

void EMAC_Interrupt_Init(void)
{
    log_info("EMAC_Interrupt_Init.\r\n");
    bl_irq_register(EMAC_IRQn, emac_irq_process);
    bl_irq_enable(EMAC_IRQn);

    emac_clrintstatus(EMAC_INT_ALL);
    emac_intmask(EMAC_INT_ALL, UNMASK);
    log_info("emac_intmask.\r\n");
}

//FIXME ugly extern functions
int emac_phy_reset(void);
int emac_phy_linkup(ETHPHY_CFG_Type *cfg);
int emac_phy_autonegotiate(ETHPHY_CFG_Type *cfg);

#if 0
static int _emac_phy_reset(ETHPHY_CFG_Type *cfg)
{
    uint32_t tmpVal;

    /* Set Phy Address */
    tmpVal=BL_RD_REG(EMAC_BASE, EMAC_MIIADDRESS);
    tmpVal=BL_SET_REG_BITS_VAL(tmpVal,EMAC_FIAD,cfg->phyAddress);
    BL_WR_REG(EMAC_BASE, EMAC_MIIADDRESS,tmpVal);

    if (SUCCESS != emac_phy_reset()) {
        return ERROR;
    }
    return SUCCESS;
}
#endif

static int _emac_phy_autonegotiation(ETHPHY_CFG_Type *cfg)
{
    uint16_t phyReg;

    if(cfg->autoNegotiation){
        uint16_t regval = 0;
        uint16_t advertise = 0;
        uint16_t lpa = 0;
        uint32_t timeout = 0x3F0;

        if (SUCCESS != emac_phy_read(PHY_BSR, &regval) || !(PHY_LINKED_STATUS & regval)) {
            return ERROR;
        }

