bouffalolab/bl_iot_sdk-components/platform/soc/bl702/bl702_ethernet/Src/eth_bd.c
        if (SUCCESS != emac_phy_read(PHY_PHYID1, &regval)) {
            return ERROR;
        }

        if (SUCCESS != emac_phy_read(PHY_PHYID2, &regval)) {
            return ERROR;
        }

        if (SUCCESS != emac_phy_read(PHY_BCR, &regval)) {
            return ERROR;
        }

        regval &= ~PHY_AUTONEGOTIATION;
        regval &= ~(PHY_LOOPBACK | PHY_POWERDOWN);
        regval |= PHY_ISOLATE;
        if(emac_phy_write(PHY_BCR, regval) != SUCCESS){
            return ERROR;
        }

        /* set advertisement mode */
        advertise = PHY_ADVERTISE_100BASETXFULL | PHY_ADVERTISE_100BASETXHALF |
                 PHY_ADVERTISE_10BASETXFULL | PHY_ADVERTISE_10BASETXHALF |
                 PHY_ADVERTISE_8023;
        if(emac_phy_write(PHY_ADVERTISE, advertise) != SUCCESS){
            return ERROR;
        }

        BL702_Delay_MS(16);
        if (SUCCESS != emac_phy_read(PHY_BCR, &regval)) {
            return ERROR;
        }

        BL702_Delay_MS(16);
        regval |= (PHY_FULLDUPLEX_100M | PHY_AUTONEGOTIATION);
        if(emac_phy_write(PHY_BCR, regval) != SUCCESS){
            return ERROR;
        }

        BL702_Delay_MS(16);
        regval |= PHY_RESTART_AUTONEGOTIATION;
        regval &= ~PHY_ISOLATE;
        if(emac_phy_write(PHY_BCR, regval) != SUCCESS){
            return ERROR;
        }

        //BL702_Delay_MS(2000);
        while(1) {
            if (SUCCESS != emac_phy_read(PHY_BSR, &regval)) {
                return ERROR;
            }

            if (regval & PHY_AUTONEGO_COMPLETE) {
                /* complete */
                break;
            }

            if (!(--timeout)) {
                printf("%s:%d\r\n", __func__, __LINE__);
                return TIMEOUT;
            }
        }

        //BL702_Delay_MS(5000);
        if (SUCCESS != emac_phy_read(PHY_LPA, &lpa)) {
            printf("%s:%d\r\n", __func__, __LINE__);
            return ERROR;
        }

        if (((advertise & lpa) & PHY_ADVERTISE_100BASETXFULL) != 0)
        {
            /* 100BaseTX and Full Duplex */
            cfg->duplex = EMAC_MODE_FULLDUPLEX;
            cfg->speed = EMAC_SPEED_100M;
        }
        else if (((advertise & lpa) & PHY_ADVERTISE_10BASETXFULL) != 0)
        {
            /* 10BaseT and Full Duplex */
            cfg->duplex = EMAC_MODE_FULLDUPLEX;
            cfg->speed = EMAC_SPEED_10M;
        }
        else if (((advertise & lpa) & PHY_ADVERTISE_100BASETXHALF) != 0)
        {
            /* 100BaseTX and half Duplex */
            cfg->duplex = EMAC_MODE_HALFDUPLEX;
            cfg->speed = EMAC_SPEED_100M;
        }
        else if (((advertise & lpa) & PHY_ADVERTISE_10BASETXHALF) != 0)
        {
            /* 10BaseT and half Duplex */
            cfg->duplex = EMAC_MODE_HALFDUPLEX;
            cfg->speed = EMAC_SPEED_10M;
        }
        return SUCCESS;
    }else{
        if(emac_phy_read(PHY_BCR, &phyReg) != SUCCESS){
            return ERROR;
        }
        phyReg&=(~PHY_FULLDUPLEX_100M);
        if(cfg->speed == EMAC_SPEED_10M){
            if(cfg->duplex==EMAC_MODE_FULLDUPLEX){
                phyReg|=PHY_FULLDUPLEX_10M;
            }else{
                phyReg|=PHY_HALFDUPLEX_10M;
            }
        }else{
            if(cfg->duplex==EMAC_MODE_FULLDUPLEX){
                phyReg|=PHY_FULLDUPLEX_100M;
            }else{
                phyReg|=PHY_HALFDUPLEX_100M;
            }
        }
        if((emac_phy_write(PHY_BCR, phyReg)) != SUCCESS){
            return ERROR;
        }
    }
    return SUCCESS;
}

static int _emac_phy_setNegotiationConfig(ETHPHY_CFG_Type *cfg)
{
    uint32_t tmpVal;

    /* Set MAC duplex config */
    tmpVal=BL_RD_REG(EMAC_BASE, EMAC_MODE);
    tmpVal=BL_SET_REG_BITS_VAL(tmpVal,EMAC_FULLD,cfg->duplex);
    BL_WR_REG(EMAC_BASE, EMAC_MODE,tmpVal);

    return SUCCESS;
}

static int _emac_phy_linkup(ETHPHY_CFG_Type *cfg)
{
    emac_phy_linkup(cfg);

    return SUCCESS;
}

static void _emac_phy_is_link_up(void) 
{
    uint16_t phy_bsr = 0;

    if(NULL == p_eth_callback || is_link_up){
        return;
    }

    if (SUCCESS != emac_phy_read(PHY_BSR, &phy_bsr) || !(PHY_LINKED_STATUS & phy_bsr)) {
        return;
    }
    p_eth_callback(ETH_INIT_STEP_LINKUP);
    is_link_up = true;
}

static int _emac_phy_linkstatus(void)
{
    uint16_t phy_bsr = 0;

    //MSG("Read link\r\n");
    if (SUCCESS != emac_phy_read(PHY_BSR, &phy_bsr)) {
        printf("%s:%d\r\n", __func__, __LINE__);
        return ERROR;
    }

    if (!(PHY_LINKED_STATUS & phy_bsr)) {
        printf("%s:%d\r\n", __func__, __LINE__);

        if(p_eth_callback && is_link_up){
            p_eth_callback(ETH_INIT_STEP_LINKDOWN);
            is_link_up = false;
        }

        return ERROR;
    }

    if(p_eth_callback && false == is_link_up){
        p_eth_callback(ETH_INIT_STEP_LINKUP);
    }
    is_link_up = true;

    return SUCCESS;
}

static void _emac_phy_if_init(void)
{
#define EMAC_PHY_INIT_STEP_RESET                (0)
#define EMAC_PHY_INIT_STEP_NEGOTIATION          (1)
#define EMAC_PHY_INIT_STEP_CONFIG               (2)
#define EMAC_PHY_INIT_STEP_LINKUP               (3)
#define EMAC_PHY_INIT_STEP_SERCIVE_START        (4)
#define EMAC_PHY_INIT_STEP_LINKMAINTAIN         (5)
    static int internal_status = 0;

    int err = SUCCESS;
    static ETHPHY_CFG_Type phyCfg={
        .autoNegotiation=ENABLE,                    /*!< Speed and mode auto negotiation */
        .duplex=EMAC_MODE_FULLDUPLEX,             /*!< Duplex mode */
        .speed=EMAC_SPEED_100M,                   /*!< Speed mode */
        .phyAddress=0x1,                            /*!< PHY address */
    };

    //log_info("_emac_phy_if_init.\r\n");
    switch (internal_status) {
        case EMAC_PHY_INIT_STEP_RESET:
        {
            log_info("EMAC_PHY_INIT_STEP_RESET.\r\n");
            {
#if 0
                bl_gpio_enable_output(9, 1, 0);
                aos_msleep(10);
                bl_gpio_output_set(9, 0);
                aos_msleep(10);
                bl_gpio_output_set(9, 1);
                aos_msleep(10);
#endif
            }

            bool isAutoNegotiation = phyCfg.autoNegotiation;
            
