bouffalolab/bl_iot_sdk-components/platform/soc/bl702/bl702_ethernet/Src/eth_bd.c
            /** set phyCfg.autoNegotiation to false to skip negotiation in emac_phyinit */
            phyCfg.autoNegotiation = false;
            err = emac_phyinit(&phyCfg);
            if(err != SUCCESS)
            {
                log_info("emac_phyinit init err[%d].\r\n", err);
            }
            phyCfg.autoNegotiation = isAutoNegotiation;
            internal_status++;
        }
        break;
        case EMAC_PHY_INIT_STEP_NEGOTIATION:
        {
            log_info("EMAC_PHY_INIT_STEP_NEGOTIATION.\r\n");
            err = _emac_phy_autonegotiation(&phyCfg);
            if(err != SUCCESS)
            {
                log_info("EMAC_PHY_INIT_STEP_NEGOTIATION err[%d].\r\n", err);
                return;
            }
            internal_status++;
        }
        break;
        case EMAC_PHY_INIT_STEP_CONFIG:
        {
            log_info("EMAC_PHY_INIT_STEP_CONFIG.\r\n");
            err = _emac_phy_setNegotiationConfig(&phyCfg);
            if(err != SUCCESS){
                log_info("EMAC_PHY_INIT_STEP_CONFIG err[%d].\r\n", err);
            }
            internal_status++;
        }
        break;
        case EMAC_PHY_INIT_STEP_LINKUP:
        {
            log_info("EMAC_PHY_INIT_STEP_LINKUP.\r\n");
            err = _emac_phy_linkup(&phyCfg);
            log_info("speed %d\r\n", phyCfg.speed);
            if(TIMEOUT==err){
                MSG("PHY Init timeout\r\n");
                while(1);
            }
            if(ERROR==err){
                MSG("PHY Init error\r\n");
                while(1);
            }
            if(phyCfg.duplex==EMAC_MODE_FULLDUPLEX){
                MSG("EMAC_MODE_FULLDUPLEX\r\n");
            }else{
                MSG("EMAC_MODE_HALFDUPLEX\r\n");
            }
            if(phyCfg.speed==EMAC_SPEED_100M){
                MSG("EMAC_SPEED_100M\r\n");
            }else{
                MSG("EMAC_SPEED_50M\r\n");
            }
            MSG("PHY Init done\r\n");
            if(p_eth_callback){
                p_eth_callback(ETH_INIT_STEP_LINKUP);
            }
            internal_status++;
        }
        break;
        case EMAC_PHY_INIT_STEP_SERCIVE_START:
        {
            log_info("EMAC_PHY_INIT_STEP_SERCIVE_START start dhcp...\r\n");
            if(p_eth_callback){
                p_eth_callback(ETH_INIT_STEP_READY);
            }
            internal_status++;
        }
        break;
        case EMAC_PHY_INIT_STEP_LINKMAINTAIN:
        {
            //log_info("EMAC_PHY_INIT_STEP_LINKMAINTAIN.\r\n");
            _emac_phy_linkstatus();
        }
        break;
        default:
        {
            log_info("emac unkonwn internal status\r\n");
        }
    }
}

void borad_eth_init(uint8_t*addr)
{
    EMAC_CFG_Type emacCfg={
        .recvSmallFrame=ENABLE,                     /*!< Receive small frmae or not */
        .recvHugeFrame=DISABLE,                     /*!< Receive huge frmae(>64K bytes) or not */
        .padEnable=ENABLE,                          /*!< Enable padding for frame which is less than MINFL or not */
        .crcEnable=ENABLE,                          /*!< Enable hardware CRC or not */
        .noPreamble=DISABLE,                        /*!< Enable preamble or not */
        .recvBroadCast=ENABLE,                      /*!< Receive broadcast frame or not */
        .interFrameGapCheck=ENABLE,                 /*!< Check inter frame gap or not */
        .miiNoPreamble=ENABLE,                      /*!< Enable MII interface preamble or not */
        .miiClkDiv=49,                              /*!< MII interface clock divider from bus clock */
        .maxTxRetry=16,                             /*!< Maximum tx retry count */
        .interFrameGapValue=24,                     /*!< Inter frame gap vaule in clock cycles(default 24)*/
        .minFrameLen=64,                            /*!< Minimum frame length */
        .maxFrameLen=ETH_MAX_BUFFER_SIZE,           /*!< Maximum frame length */
        .collisionValid=16,                         /*!< Collision valid value */
    };

    memcpy(emacCfg.macAddr, addr, sizeof(emacCfg.macAddr));
    EMAC_GPIO_Init();

#if USER_EMAC_OUTSIDE_CLK  // use outside clk
    GLB_Set_ETH_REF_O_CLK_Sel(GLB_ETH_REF_CLK_OUT_OUTSIDE_50M);
#else  // use inside clk
    //enable audio clock for emac */
    PDS_Enable_PLL_Clk(PDS_PLL_CLK_48M);
    PDS_Set_Audio_PLL_Freq(AUDIO_PLL_50000000_HZ);
    GLB_Set_ETH_REF_O_CLK_Sel(GLB_ETH_REF_CLK_OUT_INSIDE_50M);
#endif

    GLB_AHB_Slave1_Clock_Gate(0,BL_AHB_SLAVE1_EMAC);
    EMAC_Interrupt_Init();
    emac_init(&emacCfg);
    MSG("emac_init sucess\r\n");
    EMAC_BD_Init();
    emac_enable();
    //bflb_platform_init_time();
    //bflb_platform_start_time();
}

void __attribute__((weak)) eth_user_init(struct netif *netif) 
{
    uint8_t *mac = netif->hwaddr, addr[8];

    extern int bl_wireless_mac_addr_get(uint8_t mac[8]);
    bl_wireless_mac_addr_get(addr);
    mac[0] = 0x18;
    mac[1] = 0xB0;
    mac[2] = 0x09;
    mac[3] = addr[5];
    mac[4] = addr[6];
    mac[5] = addr[7];
}

/**
 * In this function, the hardware should be initialized.
 * Called from ethernetif_init().
 *
 * @param netif the already initialized lwip network interface structure
 *        for this ethernetif
 */

static void low_level_init(struct netif *netif)
{
    netif->hwaddr_len = ETHARP_HWADDR_LEN;
    netif->mtu = 1500;
    netif->flags = NETIF_FLAG_BROADCAST|NETIF_FLAG_ETHARP|NETIF_FLAG_LINK_UP|NETIF_FLAG_IGMP;
    eth_user_init(netif);

    printf("low level init\r\n");

#if LWIP_IPV6
    netif->flags |= (NETIF_FLAG_ETHERNET | NETIF_FLAG_IGMP | NETIF_FLAG_MLD6);
    netif->output_ip6 = ethip6_output;
#endif
}

static inline void bl702ethernetif_output(struct netif *netif)
{
    struct unsent_item *item;
    struct pbuf *q, *p;
    EMAC_BD_Desc_Type *bd;
    int wrap_found, offset;

    bd = &thiz->bd[thiz->txIndexCPU];
    while (0 == (bd->C_S_L & EMAC_BD_FIELD_MSK(TX_RD)) && ctx->unsent_num) {

        __disable_irq();
        item = (struct unsent_item *)utils_list_pop_front(&ctx->unsent);
        ctx->unsent_num--;
        __enable_irq();

        p = item->p;
        p->len -= PBUF_LINK_ENCAPSULATION_HLEN;
        p->tot_len -= PBUF_LINK_ENCAPSULATION_HLEN;
        p->payload += PBUF_LINK_ENCAPSULATION_HLEN;

        if ((++thiz->txIndexCPU) > thiz->txBuffLimit) {
            /* wrap back */
            thiz->txIndexCPU = 0;
            wrap_found = 1;
        } else {
            wrap_found = 0;
        }

        offset = 0;
        for (q = p; q != NULL; q = q->next) {
            memcpy((uint8_t *)bd->Buffer + offset, (uint8_t*)q->payload, q->len);
            offset += q->len;
        }
        pbuf_free(p);

        if (offset >= ETH_MAX_BUFFER_SIZE) {
            printf ("bl702ethernetif_output %d >= %d\r\n", offset, ETH_MAX_BUFFER_SIZE);
        }

        bd->C_S_L = (wrap_found ? EMAC_BD_FIELD_MSK(TX_WR) : 0) | EMAC_TX_COMMON_FLAGS | p->tot_len << BD_TX_LEN_POS;
        bd = &thiz->bd[thiz->txIndexCPU];
    }
}

void unsent_recv_task(void *pvParameters)
{
    uint32_t NotifyValue;
    BaseType_t recv;
    struct netif *netif = (struct netif *)pvParameters;

    borad_eth_init(netif->hwaddr);

