bouffalolab/bl_iot_sdk-components/platform/soc/bl702/bl702_ethernet/Src/eth_bd.c
    log_info("unsent_recv_task.\r\n");
    while(1) {
        NotifyValue = 0;
        recv = xTaskNotifyWait(0, ULONG_MAX, &NotifyValue, 200);
        if (recv == pdTRUE) {

            _emac_phy_is_link_up();
            if (NotifyValue & (1 << 0)) {
                bl702ethernetif_output(netif);
            }
            if (NotifyValue & (1 << 1)) {
                bl702ethernetif_input(netif);
            }
        } else {
            /*XXX only work when we has no EVENT. Maybe buggy here??*/
            _emac_phy_if_init();
        }
    }
}

static err_t low_level_output(struct netif *netif, struct pbuf *p)
{
    struct unsent_item *item;

    if (pbuf_header(p, PBUF_LINK_ENCAPSULATION_HLEN)) {
        printf("[TX] Reserve room failed for header\r\n");
        return ERR_IF;
    }
    item = (struct unsent_item *)(((uintptr_t)(p->payload + 3))&(~3));
    item->p = p;

    if (NULL == DequeueTaskHandle) {
        return ERR_IF;
    }
    
    pbuf_ref(p);

    __disable_irq();
    utils_list_push_back(&ctx->unsent, (struct utils_list_hdr *)&(item->hdr));
    ctx->unsent_num++;
    __enable_irq();
    xTaskNotify(DequeueTaskHandle, 0x01, eSetBits);

    return ERR_OK;
}

err_t eth_init(struct netif *netif)

{
    LWIP_ASSERT("netif != NULL", (netif != NULL));

    netif->name[0] = 'e';
    netif->name[1] = 't';
    netif->hostname = "702";
    netif->output = etharp_output;
    netif->linkoutput = low_level_output;
    log_info("eth_init.\r\n");
    low_level_init(netif);
    xTaskCreate(unsent_recv_task, (const char *)"Ontput_Unsent_queue", 1024, netif, 29, &DequeueTaskHandle);

    return ERR_OK;
}

int ethernet_init(eth_callback cb)
{
    p_eth_callback = cb;
    return 0;
}

